cases/openfoam.org/2dArbitraryMeshInterfaceNCC/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffleFaces
    {
        type        faceZone;
        zoneName    interface;

        patches
        {
            master
            {
                name            AMI1;
                type            patch;
            }
            slave
            {
                name            AMI2;
                type            patch;
            }
        }
    }
}

// ************************************************************************* //
