cases/openfoam.org/2dArbitraryMeshInterfaceNCC/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create the interface faceZone
    {
        name        interface;
        action      new;
        type        faceZoneSet;

        source      searchableSurfaceToFaceZone;
        surface     closedTriSurfaceMesh;
        file        "AMI.stl";
    }

    // Create the rotating cellZone
    {
        name        rotatingCells;
        action      new;
        type        cellZoneSet;

        source      cylinderToCell;
        point1      (0 0 0);
        point2      (0 0 1);
        radius      0.22;
    }
);


// ************************************************************************* //
